package com.up.bc.myapplicationproject;

import com.up.bc.myapplicationproject.Data.PetEvent;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Map;

public class CreateEvent {

    private ArrayList<PetEvent> aData() {
        ArrayList<PetEvent> events = new ArrayList<>();

        events.add(new PetEvent().createEvent("ลูกสุนัขอายุได้ 1 เดือน", "กำจัดพยาธิ", false).createDate(0, 1, 0).createLoop(0, 0, 0));
        events.add(new PetEvent().createEvent("ต่อมา 2 สัปดาห์ต่อครั้ง(หากถ่ายรอบแรกแล้วมีเยอะ)", "กำจัดพยาธิ", true).createDate(14, 1, 0).createLoop(14, 0, 0));
        events.add(new PetEvent().createEvent("ต่อมาทุกๆ2-3เดือนต่อครั้ง", "กำจัดพยาธิ", true).createDate(14, 1, 0).createLoop(0, 2, 0));
        events.add(new PetEvent().createEvent("ปรสิตลำไส้ 3 เดือนครั้ง", "กำจัดพยาธิ", true).createDate(0, 0, 0).createLoop(0, 3, 0));
        events.add(new PetEvent().createEvent("ปรสิตหนอนหัวใจ 2เดือนครั้ง", "กำจัดพยาธิ", true).createDate(0, 0, 0).createLoop(0, 2, 0));
        events.add(new PetEvent().createEvent("พยาธิปอด 2 เดือนครั้ง", "กำจัดพยาธิ", true).createDate(0, 0, 0).createLoop(0, 2, 0));
        events.add(new PetEvent().createEvent("หยอดทุกๆ 1 เดือน - ปรสิตภายนอก", "กำจัดเห็บ/หมัด", true).createDate(0, 0, 0).createLoop(0, 1, 0));
        events.add(new PetEvent().createEvent("ยากิน / แบบฉีด / ใส่ปอกคอกันเห็บหมัด ทุกๆ 1 เดือน", "กำจัดเห็บ/หมัด", true).createDate(0, 0, 0).createLoop(0, 1, 0));

        events.add(new PetEvent().createEvent("วัคซีนป้องกันโรคไข้หัดสุนัข และลำไส้อักเสบติดต่อ", "ฉีดวัคซีน", false).createDate(35, 0, 0).createLoop(0, 0, 0));
        events.add(new PetEvent().createEvent("วัคซีนป้องกันโรงหัดสุนัข และลำไส้อักเสบติดต่อ", "ฉีดวัคซีน", false).createDate(49, 0, 0).createLoop(0, 0, 0));
        events.add(new PetEvent().createEvent("วัคซีนรวม 5 โรค ป้องกันโรคลำไส้อักเสบติดต่อ,โรคไข้หัดสุนัข,โรคตับอักเสบติดต่อ,โรคหวัดและหลอดลมอักเสบติดต่อและโรคเลปโคสไปโรซีล", "ฉีดวัคซีน", false).createDate(56, 0, 0).createLoop(0, 0, 0));
        events.add(new PetEvent().createEvent("วัคซีนรวม 6 โรค ป้องกันลำไส้อักเสบติดต่อ, โรคไข้หัดสุนัข, โรคตับอักเสบติดต่อ, โรคหวัดและหลอดลมอักเสบติดต่อ, โรคเลปโตสไปโรซีส และโรคพิษสุนัขบ้า", "ฉีดวัคซีน", false).createDate(84, 0, 0).createLoop(0, 0, 0));
        events.add(new PetEvent().createEvent("วัคซีนรวม 6 โรค ป้องกันลำไส้อักเสบติดต่อ, โรคไข้หัดสุนัข, โรคตับอักเสบติดต่อ, โรคหวัดและหลอดลมอักเสบติดต่อ, โรคเลปโตสไปโรซีส และโรคพิษสุนัขบ้า", "ฉีดวัคซีน", true).createDate(0, 0, 1).createLoop(0, 0, 1));

        return events;
    }

    private PetEvent bData(String name) {
        if (name.contentEquals("ลาบราดอร์รีทรีฟเวอร์")) {
            return new PetEvent().createEvent("1 ครั้ง/เดือน", "อาบน้ำ", true).createDate(0, 1, 0).createLoop(0, 1, 0);
        } else {
            return new PetEvent().createEvent("1-2 ครั้ง/สัปดาห์", "อาบน้ำ", true).createDate(7, 0, 0).createLoop(7, 0, 0);
        }
    }

    public ArrayList<PetEvent> load(String breed) {

        ArrayList<PetEvent> events = new ArrayList<>();
        events = aData();
        events.add(bData(breed));


        return events;

    }

    public HashMap<String, ArrayList<String>> getMapFood() {

        HashMap<String, ArrayList<String>> map = new HashMap<>();

        ArrayList<String> a1 = new ArrayList<>();
        a1.add("นมแม่ หรือ นมแพะ");
        a1.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a1.add("อาหารเม็ด พวกที่เป็น สูตร junior chihuahua หรือ สูตร puppy heathy development เพื่อช่วยบำรุง ขนสุนัข และ เสริมสร้างสุขภาพสุนัขพันธุ์ชิวาว่าได้ ");
        a1.add("อาหารเม็ด ที่จำเป็นต่อวัยนี้ควรได้รับ สูตร puppy heathy development  เหมาะสำหรับ ช่วงวัยที่โตเต็มวัยสำหรับสายพันธุ์ชิวาว่า");
        a1.add("อาหารเม็ด แนะนำประเภท Puppy Holistic เป็นอาหารเม็ดประเภทรวมครบทุกสารอาหาร เจ้าของสุนัขอาจเสริมแคลเซียมบำรุงให้สุนัข ประเภท calcium phrusphorus magnesium และ Vitamin D3   บำรุงสมอง กระดูก บำรุงหัวใจ เสริมสร้างกล้ามเนื้อ");
        a1.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติหรือสูตร PUPPY HOLISTIC FORMULA สูตรสำหรับสุนัขตั้งครรภ์เพื่อเพิ่มน้ำนมได้ดี หรือ อาหารที่มีส่วนผสมของ โปรตีน ไขมัน แคลเซียม และ วิตามินสูง สูงกว่าสูตรปกติ ควรให้แม่หมากินอาหารสูตรนี้อย่างต่อเนื่องจนลูกหมาหย่านม");
        map.put("ชิวาว่า", a1);

        ArrayList<String> a2 = new ArrayList<>();
        a2.add("นมแม่ หรือ นมแพะ");
        a2.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a2.add("อาหารเม็ด พวกที่เป็น สูตรjunior chihuahua หรือสูตร puppy heathy development เพื่อช่วยบำรุงขนและ เสริมสร้างสุขภาพสุนัขพันธุ์ปอมเมอเรเนียนได้ ");
        a2.add("อาหารเม็ด ที่จำเป็นต่อวัยนี้ควรได้รับ สูตร puppy heathy development  เหมาะสำหรับ ช่วงวัยที่โตเต็มวัยสำหรับสายพันธุ์ปอมเมอเรเนียน");
        a2.add("อาหารเม็ด แนะนำประเภท Puppy Holistic เป็นอาหารเม็ดประเภทรวมครบทุกสารอาหาร เจ้าของสุนัขอาจเสริมแคลเซียมบำรุงให้สุนัข ประเภท calcium phrusphorus magnesium และ Vitamin D3   บำรุงสมอง กระดูก บำรุงหัวใจ เสริมสร้างกล้ามเนื้อ");
        a2.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติหรือสูตร PUPPY HOLISTIC FORMULAt เป็นสูตรสำหรับสุนัขตั้งครรภ์เพื่อเพิ่มน้ำนมได้ดี หรือ อาหารที่มีส่วนผสมของ โปรตีน แคลเซียม และ วิตามินสูง  สูงกว่าสูตรปกติ ควรให้แม่หมากินอาหารสูตรนี้อย่างต่อเนื่องจนลูกหมาหย่านม");
        map.put("ปอมเมอเรเนียน", a2);

        ArrayList<String> a3 = new ArrayList<>();
        a3.add("นมแม่ หรือ นมแพะ");
        a3.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a3.add("อาหารเม็ด พวกที่เป็นสูตรรjunior chihuahua หรือสูตร puppy heathy development เพื่อช่วยบำรุงขนและเสริมสร้างสุขภาพสุนัขพันธุ์ชิสุได้");
        a3.add("อาหารเม็ด ที่จำเป็นต่อวัยนี้ควรได้รับ สูตร puppy heathy development  เหมาะสำหรับ ช่วงวัยที่โตเต็มวัยสำหรับสายพันธุ์ชิสุ เพราะเป็นวัยที่ต้องการสารอาหาร หรือสารอาหารพวก puppy holistic เป็นชนิดอาหารที่ครบถ้วน");
        a3.add("อาหารเม็ด แนะนำประเภท Puppy Holistic เป็นอาหารเม็ดประเภทรวมครบทุกสารอาหาร เจ้าของสุนัขอาจเสริมแคลเซียมบำรุงให้สุนัข ประเภท calcium phrusphorus magnesium L-carnitineและ Vitamin D3   บำรุงสมอง กระดูก บำรุงหัวใจ เสริมสร้างกล้ามเนื้อ ");
        a3.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติหรือสูตร PUPPY HOLISTIC FORMULAt เป็นสูตรสำหรับสุนัขตั้งครรภ์เพื่อเพิ่มน้ำนมได้ดี หรือ อาหารที่มีส่วนผสมของ โปรตีน แคลเซียม และ วิตามินสูงอาหารที่มีส่วนผสมของ โปรตีน ไขมัน แคลเซียม และ วิตามินสูง  สูงกว่าสูตรปกติ ควรให้แม่หมากินอาหารสูตรนี้อย่างต่อเนื่องจนลูกหมาหย่านม");
        map.put("ชิสุ", a3);

        ArrayList<String> a4 = new ArrayList<>();
        a4.add("นมแม่ หรือ นมแพะ");
        a4.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a4.add("อาหารเม็ด พวกที่เป็นสูตรjunior chihuahua หรือสูตร puppy heathy development เพื่อบำรุงขนและเสริมสร้างสุขภาพสุนัขพันธุ์ยอร์คเชียร์เทอร์เรียได้");
        a4.add("อาหารเม็ด ที่จำเป็นต่อวัยนี้ควรได้รับ สูตร puppy heathy development  เหมาะสำหรับ ช่วงวัยที่โตเต็มวัยสำหรับสายพันธุ์ยอร์คเชียร์เทอร์เรีย เพราะเป็นวัยที่ต้องการสารอาหาร หรือสารอาหารพวก puppy holistic เป็นชนิดอาหารที่ครบถ้วน");
        a4.add("อาหารเม็ด แนะนำประเภท Puppy Holistic เป็นอาหารเม็ดประเภทรวมครบทุกสารอาหาร เจ้าของสุนัขอาจเสริมแคลเซียมบำรุงให้สุนัข ประเภท calcium phrusphorus magnesium L-carnitineและ Vitamin D3   บำรุงสมอง กระดูก บำรุงหัวใจ เสริมสร้างกล้ามเนื้อ ");
        a4.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติหรือสูตร PUPPY HOLISTIC FORMULAt เป็นสูตรสำหรับสุนัขตั้งครรภ์เพื่อเพิ่มน้ำนมได้ดี หรือ อาหารที่มีส่วนผสมของ โปรตีน แคลเซียม และ วิตามินสูงอาหารที่มีส่วนผสมของ  โปรตีน ไขมัน แคลเซียม และ วิตามินสูง สูงกว่าสูตรปกติ ควรให้แม่หมากินอาหารสูตรนี้อย่างต่อเนื่องจนลูกหมาหย่านม");
        map.put("ยอร์คเชียร์เทอร์เรีย", a4);

        ArrayList<String> a5 = new ArrayList<>();
        a5.add("นมแม่ หรือ นมแพะ");
        a5.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a5.add("อาหารเม็ด พวกที่เป็นสูตรjunior ถึง 12 morth หรือสูตร puppy heathy development เพื่อบำรุงช่วงวัยเด็กและเสริมสร้างสุขภาพสุนัขพันธุ์บีเกิลได้ ");
        a5.add("อาหารเม็ด ที่จำเป็นต่อวัยนี้ควรได้รับ สูตร puppy heathy development  เหมาะสำหรับ ช่วงวัยที่โตเต็มวัยสำหรับสายพันธุ์บีเกิล เพราะเป็นวัยที่ต้องการสารอาหาร หรือสารอาหารพวก puppy holistic เป็นชนิดอาหารที่ครบถ้วน");
        a5.add("อาหารเม็ด แนะนำประเภท Puppy Holistic เป็นอาหารเม็ดประเภทรวมครบทุกสารอาหาร เจ้าของสุนัขอาจเสริมแคลเซียมบำรุงให้สุนัข ประเภท calcium phrusphorus magnesium L-carnitineและ Vitamin D3   บำรุงสมอง กระดูก บำรุงหัวใจ เสริมสร้างกล้ามเนื้อ ");
        a5.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติหรือสูตร PUPPY HOLISTIC FORMULAt เป็นสูตรสำหรับสุนัขตั้งครรภ์เพื่อเพิ่มน้ำนมได้ดี หรือ อาหารที่มีส่วนผสมของ โปรตีน แคลเซียม และ วิตามินสูงอาหารที่มีส่วนผสมของ  โปรตีน ไขมัน แคลเซียม และ วิตามินสูง สูงกว่าสูตรปกติ ควรให้แม่หมากินอาหารสูตรนี้อย่างต่อเนื่องจนลูกหมาหย่านม");
        map.put("บีเกิล", a5);

        ArrayList<String> a6 = new ArrayList<>();
        a6.add("นมแม่ หรือ นมแพะ");
        a6.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a6.add("อาหารเม็ด พวกที่เป็นสูตรjunior ถึง 12 morth หรือสูตร puppy heathy development เพื่อบำรุงช่วงวัยเด็กและเสริมสร้างสุขภาพสุนัขพันธุ์ปั๊กได้ ");
        a6.add("อาหารเม็ด ที่จำเป็นต่อวัยนี้ควรได้รับ สูตร puppy heathy development  เหมาะสำหรับ ช่วงวัยที่โตเต็มวัยสำหรับสายพันธุ์ปั๊ก เพราะเป็นวัยที่ต้องการสารอาหาร หรือสารอาหารพวก puppy holistic เป็นชนิดอาหารที่ครบถ้วน");
        a6.add("อาหารเม็ด แนะนำประเภท Puppy Holistic เป็นอาหารเม็ดประเภทรวมครบทุกสารอาหาร เจ้าของสุนัขอาจเสริมแคลเซียมบำรุงให้สุนัข ประเภท calcium phrusphorus magnesium L-carnitineและ Vitamin D3   บำรุงสมอง กระดูก บำรุงหัวใจ เสริมสร้างกล้ามเนื้อ ");
        a6.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติหรือสูตร PUPPY HOLISTIC FORMULAt เป็นสูตรสำหรับสุนัขตั้งครรภ์เพื่อเพิ่มน้ำนมได้ดี หรือ อาหารที่มีส่วนผสมของ โปรตีน แคลเซียม และ วิตามินสูงอาหารที่มีส่วนผสมของ โปรตีน ไขมัน แคลเซียม และ วิตามินสูง สูงกว่าสูตรปกติ ควรให้แม่หมากินอาหารสูตรนี้อย่างต่อเนื่องจนลูกหมาหย่านม");
        map.put("ปั๊ก", a6);

        ArrayList<String> a7 = new ArrayList<>();
        a7.add("นมแม่ หรือ นมแพะ");
        a7.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a7.add("อาหารเม็ด พวกที่เป็นสูตร junior หรือสูตร Puppy Large Breed dog food ให้คุณค่าทางโภชนาการที่สมดุลเพื่อช่วยย่อยสารอาหาร หรืออีกอย่างสุนัขสายพันธุ์ อิงลิช บูลล์ด็อก เราสามารถเพิ่มโปรตีน ธรรมชาติ พวกเนื้อไก่ เนื้อหมู สุก แต่ไม่ควรใส่เกลือ น้ำปลา สารที่มีรสเค็ม ");
        a7.add("อาหารเม็ดที่เสริมสร้าง  Healthy Digestion ช่วยในระบบขับถ่ายให้แก่สุนัข Puppy Large Breed dog foodให้คุณค่าทางโภชนาการที่สมดุลเพื่อช่วยย่อยสารอาหาร พวกโปรตีนเนื้อสัตว์ อาหารบำรุงผิวหนังก็สำคัญกับสุนัขสายพันธุ์อิงลิช บูลล์ด็อก ไม่มีขนหนาแต่สุนัขสายพันธุ์อิงลิช บูลล์ด็อกผิวหนังแพ้ง่าย เพิ่มโปรตีนธรรมาชาติ จำพวกเนื้อไก่ เนื้อหมู");
        a7.add("อาหารเม็ดพวกสูตร Puppy Large Breed dog foodให้คุณค่าทางโภชนาการที่สมดุลเพื่อช่วยย่อยสารอาหาร หรือ  Healthy Digestion ช่วยในระบบขับถ่ายให้แก่สุนัข อาหารเม็ดประเภทบำรุงกระดูก แคลเซียม โปรตีน DHA โอเมก้า3 เลซิทิน โคลีน ช่วยพัฒนาความจำที่ดีและเสริมพัฒนาการทางสมองและสร้างความแข็งแรงให้หัวใจ  เพิ่มโปรตีนธรรมาชาติ จำพวกเนื้อไก่ เนื้อหมู");
        a7.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติ  อาจเสริมพวก ไขมัน แคลเซียม วิตามิน โปรตีนเนื้อสัตว์ลงไป ไข่ไก่ผสม  เพราะแม่สุนัขต้องเสริมสร้างน้ำนมให้แก่ลูกสุนัข  ในช่วงใกล้คลอดอาจให้เสริมอาหารที่มีกากใยอาหารมากขึ้น");
        map.put("อิงลิช บูลล์ด็อก", a7);

        ArrayList<String> a8 = new ArrayList<>();
        a8.add("นมแม่ หรือ นมแพะ");
        a8.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a8.add("อาหารเม็ด พวกที่เป็นสูตร junior หรือสูตร Puppy Large Breed dog food ให้คุณค่าทางโภชนาการที่สมดุลเพื่อช่วยย่อยสารอาหาร  Healthy Skin and Coat  ช่วยบำรุงขน ผิวหนัง เพราะสุนัขพันธุ์ ไซบีเรียน ฮักกี้ เป็นสุนัขที่มีขนหนาถึง 2 ชั้น อาหารบำรุงขนจึงสำคัญแก่น้องมาก");
        a8.add("อาหารเม็ดที่เสริมสร้างกระดูก   Healthy Skin and Coat  ช่วยบำรุงขน ผิวหนัง  Healthy Digestion ช่วยในระบบขับถ่ายให้แก่สุนัข พวกโปรตีนเนื้อสัตว์ เพราะไซบีเรียน ฮักกี้เป็นสุนัขที่ต้องการพลังงานเยอะ เราจึงต้องเสริมพวกพลังงาน ให้แก่น้องสุนัข เสริม DHA พัฒนาสมอง  กากใยอาหารก็เป็นส่วนจำเป็น");
        a8.add("อาหารเม็ดพวกสูตร Puppy Large Breed dog foodให้คุณค่าทางโภชนาการที่สมดุลเพื่อช่วยย่อยสารอาหาร หรือ  Healthy Digestion ช่วยในระบบขับถ่ายให้แก่สุนัข อาหารเม็ดประเภทบำรุงกระดูก แคลเซียม โปรตีน DHA โอเมก้า3 เลซิทิน โคลีน ช่วยพัฒนาความจำที่ดีและเสริมพัฒนาการทางสมองและสร้างความแข็งแรงให้หัวใจ");
        a8.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติ อาจเสริมพวก ไขมัน แคลเซียม วิตามิน โปรตีนเนื้อสัตว์ลงไป ไข่ไก่ผสม  เพราะแม่สุนัขต้องเสริมสร้างน้ำนมให้แก่ลูกสุนัข  ในช่วงใกล้คลอดอาจให้เสริมอาหารที่มีกากใยอาหารมากขึ้น");
        map.put("ไซบีเรียน ฮัสกี้", a8);

        ArrayList<String> a9 = new ArrayList<>();
        a9.add("นมแม่ หรือ นมแพะ");
        a9.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a9.add("อาหารเม็ด พวกที่เป็นสูตร junior หรือสูตร Puppy Large Breed dog food ให้คุณค่าทางโภชนาการที่สมดุลเพื่อช่วยย่อยสารอาหารที่ทำมาสำหรับลูกสุนัขพันธุ์ใหญ่ที่กำลังโต ");
        a9.add("อาหารเม็ด พวกที่เป็นสูตรHealthy Heart ,Healthy Skin and Coat  หรือ Healthy Digestion เพื่อเสริมสร้างความแข็งแรงของหัวใจ พวกช่วยเพิ่มประสิทธิภาพของระบบย่อยอาหารและการขับถ่าย ผิวหนังและสุขภาพขน เพราะสุนัขพันธุ์โกลเด้น รีทรีฟเวอร์ เป็นสุนัขที่ชอบน้ำ จึงต้องมีสูตรผสมอาหารที่บำรุงผิวหนังให้แก่น้องหมา ");
        a9.add("สุนัขพันธุ์โกลเด้น รีทรีฟเวอร์ เป็นสุนัขที่เป็น นักล่า สูตรอาหารแนะนำที่เหมาะสมวัยนี้ พวกแคลเซียมสูง เสริมกระดูกข้อให้แก่สุนัขพันธุ์โต โปรตีน DHA โอเมก้า3 เลซิทิน โคลีน ช่วยพัฒนาความจำที่ดีและเสริมพัฒนาการทางสมองและสร้างความแข็งแรงให้หัวใจ วิตามินอีและซีลิเนียสร้างความแข็งแรงให้หัวใจ  ย่อยง่าย ช่วยเพิ่มประสิทธิภาพของระบบย่อยอาหารและการขับถ่าย");
        a9.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติ อาจเสริมพวกแคลเซียม ไขมัน วิตามินสูง โปรตีนเนื้อสัตว์ลงไป ไข่ไก่ผสม เพราะแม่สุนัขต้องเสริมสร้างน้ำนมให้แก่ลูกสุนัข  ในช่วงใกล้คลอดอาจให้เสริมอาหารที่มีกากใยอาหารมากขึ้น");
        map.put("โกลเด้น รีทรีฟเวอร์", a9);

        ArrayList<String> a10 = new ArrayList<>();
        a10.add("นมแม่ หรือ นมแพะ");
        a10.add("นมแพะ หรือ อาหารเปียก อาหารเม็ดพวกสูตร junior ควรนำมาแช่น้ำอุ่น หรือ แช่นม เพื่อให้อาหารนุ่มขึ้น เพราะเป็นวัยที่ลูกสุนัขฟันกำลังขึ้นเป็นการช่วยให้เปลี่ยนจากกินนมแม่ เพื่อให้ลูกสุนัขกินอาหารเม็ดเป็น");
        a10.add("อาหารเม็ด พวกที่เป็นสูตร junior หรือสูตร Puppy Large Breed dog food ให้คุณค่าทางโภชนาการที่สมดุลเพื่อช่วยย่อยสารอาหารที่ทำมาสำหรับลูกสุนัขพันธุ์ใหญ่ที่กำลังโต หรือมีอีกชนิดที่เป็นเฉพาะพันธุ์ ลาบราดอร์รีทรีฟเวอร์  Labrador Retriever Junior12Kg บางยี่ห้อก็จะมีให้เฉพาะสายพันธุ์นี้");
        a10.add("อาหารเม็ดที่เหมาะแก่สุนัขพันธุ์โตอย่างลาบราดอร์รีทรีฟเวอร์ ส่วนผสมสำคัญของอาหารเม็ด ที่ควรได้รับ  โปรตีน จำพวกควบคุมโซเดียม DHA เสริมสร้างพัฒนาสมองและระบบภูมิคุ้มกัน บำรุงผิวหนัง");
        a10.add("สุนัขพันธุ์ลาบราดอร์รีทรีฟเวอร์ เป็นสุนัขที่ชอบวิ่ง นักล่า สูตรอาหารที่แนะนำเหมาะสมวัยนี้ พวกแคลเซียมสูง Joint Mobilityเสริมกระดูกข้อให้แก่สุนัขพันธุ์โต โปรตีน DHA โอเมก้า3 เลซิทิน โคลีน ช่วยพัฒนาความจำที่ดีและเสริมพัฒนาการทางสมองและสร้างความแข็งแรงให้หัวใจ วิตามินอีและซีลิเนียมสร้างความแข็งแรงให้หัวใจ  ย่อยง่าย ช่วยเพิ่มประสิทธิภาพของระบบย่อยอาหารและการขับถ่าย");
        a10.add("แม่สุนัขที่กำลังตั้งครรภ์อาหารที่แนะนำสามารถกินอาหารเม็ดได้ตามปกติ อาจเสริมพวก แคลเซียม ไขมัน วิตามินสูง โปรตีนเนื้อสัตว์ลงไป ไข่ไก่ผสม เพราะแม่สุนัขต้องเสริมสร้างน้ำนมให้แก่ลูกสุนัข  ในช่วงใกล้คลอดอาจให้เสริมอาหารที่มีกากใยอาหารมากขึ้น");
        map.put("ลาบราดอร์รีทรีฟเวอร์", a10);


        return map;
    }


    public ArrayList<String> getObject(Boolean isBig) {
        ArrayList<String> a1 = new ArrayList<>();
        a1.add("ลูกบอลพลาสติก");
        a1.add("ลูกบอลพลาสติก,เชือก");
        a1.add("ลูกบอลพลาสติก,เชือก,ตุ๊กตาพลาสิก,ขนมขัดฟัน");
        a1.add("ลูกบอลพลาสติก,เชือก,ตุ๊กตาพลาสิก,ขนมขัดฟัน");
        a1.add("ลูกบอลพลาสติก,ขนมขัดฟัน");
        a1.add("ลูกบอลพลาสติก *ไม่ควรเล่นอะไรแรง");

        ArrayList<String> a2 = new ArrayList<>();
        a2.add("ลูกบอลพลาสติก,ตุ๊กตาพลาสติก,เชือกถัด");
        a2.add("ลูกบอลพลาสติก,ตุ๊กตาพลาสติก,เชือกถัด");
        a2.add("ลูกบอลพลาสติก,ตุ๊กตาพลาสติก,เชือกถัด,ขนมขัดฟัน");
        a2.add("ลูกบอลพลาสติก,ตุ๊กตาพลาสติก,เชือกถัด,กระดูกเทียม");
        a2.add("ลูกบอลพลาสติก,ตุ๊กตาพลาสติก,เชือกถัด");
        a2.add("ลูกบอลพลาสติก,ตุ๊กตาพลาสติก,เชือกถัด  *ไม่ควรเล่นอะไรแรง");

        if (isBig) {
            return a2;
        } else {
            return a1;
        }
    }

    public ArrayList<String> getFood(String name) {

        return getMapFood().get(name);

    }




}
